hungtho/LDC_7kW/KSC_LDC/components/spc570sxx_low_level_drivers_component_rla/lib/src/spc5_linflex.c
/****************************************************************************
*
* Copyright © 2018-2019 STMicroelectronics - All Rights Reserved
*
* License terms: STMicroelectronics Proprietary in accordance with licensing
* terms SLA0089 at www.st.com.
* 
* THIS SOFTWARE IS DISTRIBUTED "AS IS," AND ALL WARRANTIES ARE DISCLAIMED,
* INCLUDING MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.
*
* EVALUATION ONLY - NOT FOR USE IN PRODUCTION
*****************************************************************************/
/**
 * @file    spc5_linflex.c
 * @brief   SPC5xx LINFLEX low level driver code.
 *
 * @addtogroup LINFLEX
 * @{
 */

#include "spc5_linflex.h"
#include "serial_lld.h"
#include "lin_lld.h"

#if (LLD_USE_SERIAL == TRUE) || (LLD_USE_LIN == TRUE) || defined(__DOXYGEN__)

/*===========================================================================*/
/* Driver local definitions.                                                 */
/*===========================================================================*/

/**
 * @brief   LinFlex initialization flag.
 */
static uint8_t linflex_initialization = 0U;

/*===========================================================================*/
/* Driver exported variables.                                                */
/*===========================================================================*/

/**
 * @brief   LIINFlex-0 serial driver identifier.
 */
#if (SPC5_LINFLEX0_SETTING != SPC5_LINFLEX_MODE_NONE) || defined(__DOXYGEN__)
LinflexDriver LinflexD1;
#endif

/**
 * @brief   LIINFlex-1 serial driver identifier.
 */
#if (SPC5_LINFLEX1_SETTING != SPC5_LINFLEX_MODE_NONE) || defined(__DOXYGEN__)
LinflexDriver LinflexD2;
#endif

/**
 * @brief   LIINFlex-2 serial driver identifier.
 */
#if (SPC5_LINFLEX2_SETTING != SPC5_LINFLEX_MODE_NONE) || defined(__DOXYGEN__)
LinflexDriver LinflexD3;
#endif

/**
 * @brief   LIINFlex-3 serial driver identifier.
 */
#if (SPC5_LINFLEX3_SETTING != SPC5_LINFLEX_MODE_NONE) || defined(__DOXYGEN__)
LinflexDriver LinflexD4;
#endif

/**
 * @brief   LIINFlex-4 serial driver identifier.
 */
#if (SPC5_LINFLEX4_SETTING != SPC5_LINFLEX_MODE_NONE) || defined(__DOXYGEN__)
LinflexDriver LinflexD5;
#endif

/**
 * @brief   LIINFlex-5 serial driver identifier.
 */
#if (SPC5_LINFLEX5_SETTING != SPC5_LINFLEX_MODE_NONE) || defined(__DOXYGEN__)
LinflexDriver LinflexD6;
#endif

/**
 * @brief   LIINFlex-6 serial driver identifier.
 */
#if (SPC5_LINFLEX6_SETTING != SPC5_LINFLEX_MODE_NONE) || defined(__DOXYGEN__)
LinflexDriver LinflexD7;
#endif

/**
 * @brief   LIINFlex-7 serial driver identifier.
 */
#if (SPC5_LINFLEX7_SETTING != SPC5_LINFLEX_MODE_NONE) || defined(__DOXYGEN__)
LinflexDriver LinflexD8;
#endif

/**
 * @brief   LIINFlex-8 serial driver identifier.
 */
#if (SPC5_LINFLEX8_SETTING != SPC5_LINFLEX_MODE_NONE) || defined(__DOXYGEN__)
LinflexDriver LinflexD9;
#endif

/**
 * @brief   LIINFlex-9 serial driver identifier.
 */
#if (SPC5_LINFLEX9_SETTING != SPC5_LINFLEX_MODE_NONE) || defined(__DOXYGEN__)
LinflexDriver LinflexD10;
#endif

/**
 * @brief   LIINFlex-10 serial driver identifier.
 */
#if (SPC5_LINFLEX10_SETTING != SPC5_LINFLEX_MODE_NONE) || defined(__DOXYGEN__)
LinflexDriver LinflexD11;
#endif

/**
 * @brief   LIINFlex-11 serial driver identifier.
 */
#if (SPC5_LINFLEX11_SETTING != SPC5_LINFLEX_MODE_NONE) || defined(__DOXYGEN__)
LinflexDriver LinflexD12;
#endif

/**
 * @brief   LIINFlex-12 serial driver identifier.
 */
#if (SPC5_LINFLEX12_SETTING != SPC5_LINFLEX_MODE_NONE) || defined(__DOXYGEN__)
LinflexDriver LinflexD13;
#endif

/**
 * @brief   LIINFlex-13 serial driver identifier.
 */
#if (SPC5_LINFLEX13_SETTING != SPC5_LINFLEX_MODE_NONE) || defined(__DOXYGEN__)
LinflexDriver LinflexD14;
#endif

/**
 * @brief   LIINFlex-14 serial driver identifier.
 */
#if (SPC5_LINFLEX14_SETTING != SPC5_LINFLEX_MODE_NONE) || defined(__DOXYGEN__)
LinflexDriver LinflexD15;
#endif

/**
 * @brief   LIINFlex-15 serial driver identifier.
 */
#if (SPC5_LINFLEX15_SETTING != SPC5_LINFLEX_MODE_NONE) || defined(__DOXYGEN__)
LinflexDriver LinflexD16;
#endif

/**
 * @brief   LIINFlex-16 serial driver identifier.
 */
#if (SPC5_LINFLEX16_SETTING != SPC5_LINFLEX_MODE_NONE) || defined(__DOXYGEN__)
LinflexDriver LinflexD17;
#endif

/**
 * @brief   LIINFlex-17 serial driver identifier.
 */
#if (SPC5_LINFLEX17_SETTING != SPC5_LINFLEX_MODE_NONE) || defined(__DOXYGEN__)
LinflexDriver LinflexD18;
#endif

/**
 * @brief   LIINFlex-18 serial driver identifier.
 */
#if (SPC5_LINFLEX18_SETTING != SPC5_LINFLEX_MODE_NONE) || defined(__DOXYGEN__)
LinflexDriver LinflexD19;
#endif

/**
 * @brief   LIINFlex-19 serial driver identifier.
 */
#if (SPC5_LINFLEX19_SETTING != SPC5_LINFLEX_MODE_NONE) || defined(__DOXYGEN__)
LinflexDriver LinflexD20;
#endif

/**
 * @brief   LIINFlex-20 serial driver identifier.
 */
#if (SPC5_LINFLEX20_SETTING != SPC5_LINFLEX_MODE_NONE) || defined(__DOXYGEN__)
LinflexDriver LinflexD21;
#endif

/**
 * @brief   LIINFlex-21 serial driver identifier.
 */
#if (SPC5_LINFLEX21_SETTING != SPC5_LINFLEX_MODE_NONE) || defined(__DOXYGEN__)
LinflexDriver LinflexD22;
#endif

/**
 * @brief   LIINFlex-22 serial driver identifier.
 */
#if (SPC5_LINFLEX22_SETTING != SPC5_LINFLEX_MODE_NONE) || defined(__DOXYGEN__)
LinflexDriver LinflexD23;
#endif

/**
 * @brief   LIINFlex-23 serial driver identifier.
 */
#if (SPC5_LINFLEX23_SETTING != SPC5_LINFLEX_MODE_NONE) || defined(__DOXYGEN__)
LinflexDriver LinflexD24;
#endif

/*===========================================================================*/
/* Driver local variables and types.                                         */
/*===========================================================================*/

/*===========================================================================*/
/* Driver local functions.                                                   */
/*===========================================================================*/

/*===========================================================================*/
/* Driver interrupt handlers.                                                */
/*===========================================================================*/

#if (SPC5_LINFLEX0_SETTING != SPC5_LINFLEX_MODE_NONE) || defined(__DOXYGEN__)
#if !defined(SPC5_LINFLEX0_RXI_HANDLER)
#error "SPC5_LINFLEX0_RXI_HANDLER not defined"
#endif
/**
 * @brief   LINFlex-0 RXI interrupt handler.
 *
 * @isr
 */
IRQ_HANDLER(SPC5_LINFLEX0_RXI_HANDLER) {
  IRQ_PROLOGUE();

