hungtho/LDC_7kW/KSC_LDC/components/spc570sxx_low_level_drivers_component_rla/lib/src/spc5_linflex.c
  LinflexD1.rxi_lincallback(LinflexD1.device);

  IRQ_EPILOGUE();
}

#if !defined(SPC5_LINFLEX0_TXI_HANDLER)
#error "SPC5_LINFLEX0_TXI_HANDLER not defined"
#endif
/**
 * @brief   LINFlex-0 TXI interrupt handler.
 *
 * @isr
 */
IRQ_HANDLER(SPC5_LINFLEX0_TXI_HANDLER) {

  IRQ_PROLOGUE();

  LinflexD1.txi_lincallback(LinflexD1.device);

  IRQ_EPILOGUE();
}

#if !defined(SPC5_LINFLEX0_ERR_HANDLER)
#error "SPC5_LINFLEX0_ERR_HANDLER not defined"
#endif
/**
 * @brief   LINFlex-0 ERR interrupt handler.
 *
 * @isr
 */
IRQ_HANDLER(SPC5_LINFLEX0_ERR_HANDLER) {

  IRQ_PROLOGUE();

  LinflexD1.err_lincallback(LinflexD1.device);

  IRQ_EPILOGUE();
}
#endif

#if (SPC5_LINFLEX1_SETTING != SPC5_LINFLEX_MODE_NONE) || defined(__DOXYGEN__)
#if !defined(SPC5_LINFLEX1_RXI_HANDLER)
#error "SPC5_LINFLEX1_RXI_HANDLER not defined"
#endif
/**
 * @brief   LINFlex-1 RXI interrupt handler.
 *
 * @isr
 */
IRQ_HANDLER(SPC5_LINFLEX1_RXI_HANDLER) {

  IRQ_PROLOGUE();

  LinflexD2.rxi_lincallback(LinflexD2.device);

  IRQ_EPILOGUE();
}

#if !defined(SPC5_LINFLEX1_TXI_HANDLER)
#error "SPC5_LINFLEX1_TXI_HANDLER not defined"
#endif
/**
 * @brief   LINFlex-1 TXI interrupt handler.
 *
 * @isr
 */
IRQ_HANDLER(SPC5_LINFLEX1_TXI_HANDLER) {

  IRQ_PROLOGUE();

  LinflexD2.txi_lincallback(LinflexD2.device);

  IRQ_EPILOGUE();
}

#if !defined(SPC5_LINFLEX1_ERR_HANDLER)
#error "SPC5_LINFLEX1_ERR_HANDLER not defined"
#endif
/**
 * @brief   LINFlex-1 ERR interrupt handler.
 *
 * @isr
 */
IRQ_HANDLER(SPC5_LINFLEX1_ERR_HANDLER) {

  IRQ_PROLOGUE();

  LinflexD2.err_lincallback(LinflexD2.device);

  IRQ_EPILOGUE();
}
#endif

#if (SPC5_LINFLEX2_SETTING != SPC5_LINFLEX_MODE_NONE) || defined(__DOXYGEN__)
#if !defined(SPC5_LINFLEX2_RXI_HANDLER)
#error "SPC5_LINFLEX2_RXI_HANDLER not defined"
#endif
/**
 * @brief   LINFlex-2 RXI interrupt handler.
 *
 * @isr
 */
IRQ_HANDLER(SPC5_LINFLEX2_RXI_HANDLER) {

  IRQ_PROLOGUE();

  LinflexD3.rxi_lincallback(LinflexD3.device);

  IRQ_EPILOGUE();
}

#if !defined(SPC5_LINFLEX2_TXI_HANDLER)
#error "SPC5_LINFLEX2_TXI_HANDLER not defined"
#endif
/**
 * @brief   LINFlex-2 TXI interrupt handler.
 *
 * @isr
 */
IRQ_HANDLER(SPC5_LINFLEX2_TXI_HANDLER) {

  IRQ_PROLOGUE();

  LinflexD3.txi_lincallback(LinflexD3.device);

  IRQ_EPILOGUE();
}

#if !defined(SPC5_LINFLEX2_ERR_HANDLER)
#error "SPC5_LINFLEX2_ERR_HANDLER not defined"
#endif
/**
 * @brief   LINFlex-2 ERR interrupt handler.
 *
 * @isr
 */
IRQ_HANDLER(SPC5_LINFLEX2_ERR_HANDLER) {

  IRQ_PROLOGUE();

  LinflexD3.err_lincallback(LinflexD3.device);

  IRQ_EPILOGUE();
}
#endif

#if (SPC5_LINFLEX3_SETTING != SPC5_LINFLEX_MODE_NONE) || defined(__DOXYGEN__)
#if !defined(SPC5_LINFLEX3_RXI_HANDLER)
#error "SPC5_LINFLEX3_RXI_HANDLER not defined"
#endif
/**
 * @brief   LINFlex-3 RXI interrupt handler.
 *
 * @isr
 */
IRQ_HANDLER(SPC5_LINFLEX3_RXI_HANDLER) {

  IRQ_PROLOGUE();

  LinflexD4.rxi_lincallback(LinflexD4.device);

  IRQ_EPILOGUE();
}

#if !defined(SPC5_LINFLEX3_TXI_HANDLER)
#error "SPC5_LINFLEX3_TXI_HANDLER not defined"
#endif
/**
 * @brief   LINFlex-3 TXI interrupt handler.
 *
 * @isr
 */
IRQ_HANDLER(SPC5_LINFLEX3_TXI_HANDLER) {

  IRQ_PROLOGUE();

  LinflexD4.txi_lincallback(LinflexD4.device);

  IRQ_EPILOGUE();
}

#if !defined(SPC5_LINFLEX3_ERR_HANDLER)
#error "SPC5_LINFLEX3_ERR_HANDLER not defined"
#endif
/**
 * @brief   LINFlex-3 ERR interrupt handler.
 *
 * @isr
 */
IRQ_HANDLER(SPC5_LINFLEX3_ERR_HANDLER) {

  IRQ_PROLOGUE();

  LinflexD4.err_lincallback(LinflexD4.device);

  IRQ_EPILOGUE();
}
#endif

#if (SPC5_LINFLEX4_SETTING != SPC5_LINFLEX_MODE_NONE) || defined(__DOXYGEN__)
#if !defined(SPC5_LINFLEX4_RXI_HANDLER)
#error "SPC5_LINFLEX4_RXI_HANDLER not defined"
#endif
/**
 * @brief   LINFlex-4 RXI interrupt handler.
 *
 * @isr
 */
IRQ_HANDLER(SPC5_LINFLEX4_RXI_HANDLER) {

  IRQ_PROLOGUE();

  LinflexD5.rxi_lincallback(LinflexD5.device);

  IRQ_EPILOGUE();
}

#if !defined(SPC5_LINFLEX4_TXI_HANDLER)
#error "SPC5_LINFLEX4_TXI_HANDLER not defined"
#endif
/**
 * @brief   LINFlex-4 TXI interrupt handler.
 *
 * @isr
 */
IRQ_HANDLER(SPC5_LINFLEX4_TXI_HANDLER) {

  IRQ_PROLOGUE();

  LinflexD5.txi_lincallback(LinflexD5.device);

  IRQ_EPILOGUE();
}

#if !defined(SPC5_LINFLEX4_ERR_HANDLER)
#error "SPC5_LINFLEX4_ERR_HANDLER not defined"
#endif
/**
 * @brief   LINFlex-4 ERR interrupt handler.
 *
 * @isr
 */
IRQ_HANDLER(SPC5_LINFLEX4_ERR_HANDLER) {

  IRQ_PROLOGUE();

  LinflexD5.err_lincallback(LinflexD5.device);

  IRQ_EPILOGUE();
}
#endif

#if (SPC5_LINFLEX5_SETTING != SPC5_LINFLEX_MODE_NONE) || defined(__DOXYGEN__)
#if !defined(SPC5_LINFLEX5_RXI_HANDLER)
#error "SPC5_LINFLEX5_RXI_HANDLER not defined"
#endif
/**
 * @brief   LINFlex-5 RXI interrupt handler.
 *
 * @isr
 */
IRQ_HANDLER(SPC5_LINFLEX5_RXI_HANDLER) {

  IRQ_PROLOGUE();

  LinflexD6.rxi_lincallback(LinflexD6.device);

  IRQ_EPILOGUE();
}

#if !defined(SPC5_LINFLEX5_TXI_HANDLER)
#error "SPC5_LINFLEX5_TXI_HANDLER not defined"
#endif
/**
 * @brief   LINFlex-5 TXI interrupt handler.
 *
 * @isr
 */
IRQ_HANDLER(SPC5_LINFLEX5_TXI_HANDLER) {

  IRQ_PROLOGUE();

  LinflexD6.txi_lincallback(LinflexD6.device);

  IRQ_EPILOGUE();
}

#if !defined(SPC5_LINFLEX5_ERR_HANDLER)
#error "SPC5_LINFLEX5_ERR_HANDLER not defined"
#endif
/**
 * @brief   LINFlex-5 ERR interrupt handler.
 *
 * @isr
 */
IRQ_HANDLER(SPC5_LINFLEX5_ERR_HANDLER) {

  IRQ_PROLOGUE();

  LinflexD6.err_lincallback(LinflexD6.device);

  IRQ_EPILOGUE();
}
#endif

#if (SPC5_LINFLEX6_SETTING != SPC5_LINFLEX_MODE_NONE) || defined(__DOXYGEN__)
#if !defined(SPC5_LINFLEX6_RXI_HANDLER)
#error "SPC5_LINFLEX6_RXI_HANDLER not defined"
#endif
/**
 * @brief   LINFlex-6 RXI interrupt handler.
 *
 * @isr
 */
IRQ_HANDLER(SPC5_LINFLEX6_RXI_HANDLER) {

  IRQ_PROLOGUE();

  LinflexD7.rxi_lincallback(LinflexD7.device);

  IRQ_EPILOGUE();
}

#if !defined(SPC5_LINFLEX6_TXI_HANDLER)
#error "SPC5_LINFLEX6_TXI_HANDLER not defined"
#endif
/**
 * @brief   LINFlex-6 TXI interrupt handler.
 *
 * @isr
 */
IRQ_HANDLER(SPC5_LINFLEX6_TXI_HANDLER) {

  IRQ_PROLOGUE();

  LinflexD7.txi_lincallback(LinflexD7.device);

