hungtho/LDC_7kW/KSC_LDC/components/spc570sxx_low_level_drivers_component_rla/lib/src/spc5_linflex.c
  IRQ_EPILOGUE();
}

#if !defined(SPC5_LINFLEX6_ERR_HANDLER)
#error "SPC5_LINFLEX6_ERR_HANDLER not defined"
#endif
/**
 * @brief   LINFlex-6 ERR interrupt handler.
 *
 * @isr
 */
IRQ_HANDLER(SPC5_LINFLEX6_ERR_HANDLER) {

  IRQ_PROLOGUE();

  LinflexD7.err_lincallback(LinflexD7.device);

  IRQ_EPILOGUE();
}
#endif

#if (SPC5_LINFLEX7_SETTING != SPC5_LINFLEX_MODE_NONE) || defined(__DOXYGEN__)
#if !defined(SPC5_LINFLEX7_RXI_HANDLER)
#error "SPC5_LINFLEX7_RXI_HANDLER not defined"
#endif
/**
 * @brief   LINFlex-7 RXI interrupt handler.
 *
 * @isr
 */
IRQ_HANDLER(SPC5_LINFLEX7_RXI_HANDLER) {

  IRQ_PROLOGUE();

  LinflexD8.rxi_lincallback(LinflexD8.device);

  IRQ_EPILOGUE();
}

#if !defined(SPC5_LINFLEX7_TXI_HANDLER)
#error "SPC5_LINFLEX7_TXI_HANDLER not defined"
#endif
/**
 * @brief   LINFlex-7 TXI interrupt handler.
 *
 * @isr
 */
IRQ_HANDLER(SPC5_LINFLEX7_TXI_HANDLER) {

  IRQ_PROLOGUE();

  LinflexD8.txi_lincallback(LinflexD8.device);

  IRQ_EPILOGUE();
}

#if !defined(SPC5_LINFLEX7_ERR_HANDLER)
#error "SPC5_LINFLEX7_ERR_HANDLER not defined"
#endif
/**
 * @brief   LINFlex-7 ERR interrupt handler.
 *
 * @isr
 */
IRQ_HANDLER(SPC5_LINFLEX7_ERR_HANDLER) {

  IRQ_PROLOGUE();

  LinflexD8.err_lincallback(LinflexD8.device);

  IRQ_EPILOGUE();
}
#endif

#if (SPC5_LINFLEX8_SETTING != SPC5_LINFLEX_MODE_NONE) || defined(__DOXYGEN__)
#if !defined(SPC5_LINFLEX8_RXI_HANDLER)
#error "SPC5_LINFLEX8_RXI_HANDLER not defined"
#endif
/**
 * @brief   LINFlex-8 RXI interrupt handler.
 *
 * @isr
 */
IRQ_HANDLER(SPC5_LINFLEX8_RXI_HANDLER) {

  IRQ_PROLOGUE();

  LinflexD9.rxi_lincallback(LinflexD9.device);

  IRQ_EPILOGUE();
}

#if !defined(SPC5_LINFLEX8_TXI_HANDLER)
#error "SPC5_LINFLEX8_TXI_HANDLER not defined"
#endif
/**
 * @brief   LINFlex-8 TXI interrupt handler.
 *
 * @isr
 */
IRQ_HANDLER(SPC5_LINFLEX8_TXI_HANDLER) {

  IRQ_PROLOGUE();

  LinflexD9.txi_lincallback(LinflexD9.device);

  IRQ_EPILOGUE();
}

#if !defined(SPC5_LINFLEX8_ERR_HANDLER)
#error "SPC5_LINFLEX8_ERR_HANDLER not defined"
#endif
/**
 * @brief   LINFlex-8 ERR interrupt handler.
 *
 * @isr
 */
IRQ_HANDLER(SPC5_LINFLEX8_ERR_HANDLER) {

  IRQ_PROLOGUE();

  LinflexD9.err_lincallback(LinflexD9.device);

  IRQ_EPILOGUE();
}
#endif

#if (SPC5_LINFLEX9_SETTING != SPC5_LINFLEX_MODE_NONE) || defined(__DOXYGEN__)
#if !defined(SPC5_LINFLEX9_RXI_HANDLER)
#error "SPC5_LINFLEX9_RXI_HANDLER not defined"
#endif
/**
 * @brief   LINFlex-9 RXI interrupt handler.
 *
 * @isr
 */
IRQ_HANDLER(SPC5_LINFLEX9_RXI_HANDLER) {

  IRQ_PROLOGUE();

  LinflexD10.rxi_lincallback(LinflexD10.device);

  IRQ_EPILOGUE();
}

#if !defined(SPC5_LINFLEX9_TXI_HANDLER)
#error "SPC5_LINFLEX9_TXI_HANDLER not defined"
#endif
/**
 * @brief   LINFlex-9 TXI interrupt handler.
 *
 * @isr
 */
IRQ_HANDLER(SPC5_LINFLEX9_TXI_HANDLER) {

  IRQ_PROLOGUE();

  LinflexD10.txi_lincallback(LinflexD10.device);

  IRQ_EPILOGUE();
}

#if !defined(SPC5_LINFLEX9_ERR_HANDLER)
#error "SPC5_LINFLEX9_ERR_HANDLER not defined"
#endif
/**
 * @brief   LINFlex-9 ERR interrupt handler.
 *
 * @isr
 */
IRQ_HANDLER(SPC5_LINFLEX9_ERR_HANDLER) {

  IRQ_PROLOGUE();

  LinflexD10.err_lincallback(LinflexD10.device);

  IRQ_EPILOGUE();
}
#endif

#if (SPC5_LINFLEX10_SETTING != SPC5_LINFLEX_MODE_NONE) || defined(__DOXYGEN__)
#if !defined(SPC5_LINFLEX10_RXI_HANDLER)
#error "SPC5_LINFLEX10_RXI_HANDLER not defined"
#endif
/**
 * @brief   LINFlex-10 RXI interrupt handler.
 *
 * @isr
 */
IRQ_HANDLER(SPC5_LINFLEX10_RXI_HANDLER) {

  IRQ_PROLOGUE();

  LinflexD11.rxi_lincallback(LinflexD11.device);

  IRQ_EPILOGUE();
}

#if !defined(SPC5_LINFLEX10_TXI_HANDLER)
#error "SPC5_LINFLEX10_TXI_HANDLER not defined"
#endif
/**
 * @brief   LINFlex-10 TXI interrupt handler.
 *
 * @isr
 */
IRQ_HANDLER(SPC5_LINFLEX10_TXI_HANDLER) {

  IRQ_PROLOGUE();

  LinflexD11.txi_lincallback(LinflexD11.device);

  IRQ_EPILOGUE();
}

#if !defined(SPC5_LINFLEX10_ERR_HANDLER)
#error "SPC5_LINFLEX10_ERR_HANDLER not defined"
#endif
/**
 * @brief   LINFlex-10 ERR interrupt handler.
 *
 * @isr
 */
IRQ_HANDLER(SPC5_LINFLEX10_ERR_HANDLER) {

  IRQ_PROLOGUE();

  LinflexD11.err_lincallback(LinflexD11.device);

  IRQ_EPILOGUE();
}
#endif

#if (SPC5_LINFLEX11_SETTING != SPC5_LINFLEX_MODE_NONE) || defined(__DOXYGEN__)
#if !defined(SPC5_LINFLEX11_RXI_HANDLER)
#error "SPC5_LINFLEX11_RXI_HANDLER not defined"
#endif
/**
 * @brief   LINFlex-11 RXI interrupt handler.
 *
 * @isr
 */
IRQ_HANDLER(SPC5_LINFLEX11_RXI_HANDLER) {

  IRQ_PROLOGUE();

  LinflexD12.rxi_lincallback(LinflexD12.device);

  IRQ_EPILOGUE();
}

#if !defined(SPC5_LINFLEX11_TXI_HANDLER)
#error "SPC5_LINFLEX11_TXI_HANDLER not defined"
#endif
/**
 * @brief   LINFlex-11 TXI interrupt handler.
 *
 * @isr
 */
IRQ_HANDLER(SPC5_LINFLEX11_TXI_HANDLER) {

  IRQ_PROLOGUE();

  LinflexD12.txi_lincallback(LinflexD12.device);

  IRQ_EPILOGUE();
}

#if !defined(SPC5_LINFLEX11_ERR_HANDLER)
#error "SPC5_LINFLEX11_ERR_HANDLER not defined"
#endif
/**
 * @brief   LINFlex-11 ERR interrupt handler.
 *
 * @isr
 */
IRQ_HANDLER(SPC5_LINFLEX11_ERR_HANDLER) {

  IRQ_PROLOGUE();

  LinflexD12.err_lincallback(LinflexD12.device);

  IRQ_EPILOGUE();
}
#endif

#if (SPC5_LINFLEX12_SETTING != SPC5_LINFLEX_MODE_NONE) || defined(__DOXYGEN__)
#if !defined(SPC5_LINFLEX12_RXI_HANDLER)
#error "SPC5_LINFLEX12_RXI_HANDLER not defined"
#endif
/**
 * @brief   LINFlex-12 RXI interrupt handler.
 *
 * @isr
 */
IRQ_HANDLER(SPC5_LINFLEX12_RXI_HANDLER) {

  IRQ_PROLOGUE();

  LinflexD13.rxi_lincallback(LinflexD13.device);

  IRQ_EPILOGUE();
}

#if !defined(SPC5_LINFLEX12_TXI_HANDLER)
#error "SPC5_LINFLEX12_TXI_HANDLER not defined"
#endif
/**
 * @brief   LINFlex-12 TXI interrupt handler.
 *
 * @isr
 */
IRQ_HANDLER(SPC5_LINFLEX12_TXI_HANDLER) {

  IRQ_PROLOGUE();

  LinflexD13.txi_lincallback(LinflexD13.device);

  IRQ_EPILOGUE();
}

#if !defined(SPC5_LINFLEX12_ERR_HANDLER)
#error "SPC5_LINFLEX12_ERR_HANDLER not defined"
#endif
/**
 * @brief   LINFlex-12 ERR interrupt handler.
 *
 * @isr
 */
IRQ_HANDLER(SPC5_LINFLEX12_ERR_HANDLER) {

  IRQ_PROLOGUE();

  LinflexD13.err_lincallback(LinflexD13.device);

