hungtho/LDC_7kW/KSC_LDC/components/spc570sxx_low_level_drivers_component_rla/lib/src/spc5_linflex.c
  IRQ_EPILOGUE();
}
#endif

#if (SPC5_LINFLEX13_SETTING != SPC5_LINFLEX_MODE_NONE) || defined(__DOXYGEN__)
#if !defined(SPC5_LINFLEX13_RXI_HANDLER)
#error "SPC5_LINFLEX13_RXI_HANDLER not defined"
#endif
/**
 * @brief   LINFlex-13 RXI interrupt handler.
 *
 * @isr
 */
IRQ_HANDLER(SPC5_LINFLEX13_RXI_HANDLER) {

  IRQ_PROLOGUE();

  LinflexD14.rxi_lincallback(LinflexD14.device);

  IRQ_EPILOGUE();
}

#if !defined(SPC5_LINFLEX13_TXI_HANDLER)
#error "SPC5_LINFLEX13_TXI_HANDLER not defined"
#endif
/**
 * @brief   LINFlex-13 TXI interrupt handler.
 *
 * @isr
 */
IRQ_HANDLER(SPC5_LINFLEX13_TXI_HANDLER) {

  IRQ_PROLOGUE();

  LinflexD14.txi_lincallback(LinflexD14.device);

  IRQ_EPILOGUE();
}

#if !defined(SPC5_LINFLEX13_ERR_HANDLER)
#error "SPC5_LINFLEX13_ERR_HANDLER not defined"
#endif
/**
 * @brief   LINFlex-13 ERR interrupt handler.
 *
 * @isr
 */
IRQ_HANDLER(SPC5_LINFLEX13_ERR_HANDLER) {

  IRQ_PROLOGUE();

  LinflexD14.err_lincallback(LinflexD14.device);

  IRQ_EPILOGUE();
}
#endif

#if (SPC5_LINFLEX14_SETTING != SPC5_LINFLEX_MODE_NONE) || defined(__DOXYGEN__)
#if !defined(SPC5_LINFLEX14_RXI_HANDLER)
#error "SPC5_LINFLEX14_RXI_HANDLER not defined"
#endif
/**
 * @brief   LINFlex-14 RXI interrupt handler.
 *
 * @isr
 */
IRQ_HANDLER(SPC5_LINFLEX14_RXI_HANDLER) {

  IRQ_PROLOGUE();

  LinflexD15.rxi_lincallback(LinflexD15.device);

  IRQ_EPILOGUE();
}

#if !defined(SPC5_LINFLEX14_TXI_HANDLER)
#error "SPC5_LINFLEX14_TXI_HANDLER not defined"
#endif
/**
 * @brief   LINFlex-14 TXI interrupt handler.
 *
 * @isr
 */
IRQ_HANDLER(SPC5_LINFLEX14_TXI_HANDLER) {

  IRQ_PROLOGUE();

  LinflexD15.txi_lincallback(LinflexD15.device);

  IRQ_EPILOGUE();
}

#if !defined(SPC5_LINFLEX14_ERR_HANDLER)
#error "SPC5_LINFLEX14_ERR_HANDLER not defined"
#endif
/**
 * @brief   LINFlex-14 ERR interrupt handler.
 *
 * @isr
 */
IRQ_HANDLER(SPC5_LINFLEX14_ERR_HANDLER) {

  IRQ_PROLOGUE();

  LinflexD15.err_lincallback(LinflexD15.device);

  IRQ_EPILOGUE();
}
#endif

#if (SPC5_LINFLEX15_SETTING != SPC5_LINFLEX_MODE_NONE) || defined(__DOXYGEN__)
#if !defined(SPC5_LINFLEX15_RXI_HANDLER)
#error "SPC5_LINFLEX15_RXI_HANDLER not defined"
#endif
/**
 * @brief   LINFlex-15 RXI interrupt handler.
 *
 * @isr
 */
IRQ_HANDLER(SPC5_LINFLEX15_RXI_HANDLER) {

  IRQ_PROLOGUE();

  LinflexD16.rxi_lincallback(LinflexD16.device);

  IRQ_EPILOGUE();
}

#if !defined(SPC5_LINFLEX15_TXI_HANDLER)
#error "SPC5_LINFLEX15_TXI_HANDLER not defined"
#endif
/**
 * @brief   LINFlex-15 TXI interrupt handler.
 *
 * @isr
 */
IRQ_HANDLER(SPC5_LINFLEX15_TXI_HANDLER) {

  IRQ_PROLOGUE();

  LinflexD16.txi_lincallback(LinflexD16.device);

  IRQ_EPILOGUE();
}

#if !defined(SPC5_LINFLEX15_ERR_HANDLER)
#error "SPC5_LINFLEX15_ERR_HANDLER not defined"
#endif
/**
 * @brief   LINFlex-15 ERR interrupt handler.
 *
 * @isr
 */
IRQ_HANDLER(SPC5_LINFLEX15_ERR_HANDLER) {

  IRQ_PROLOGUE();

  LinflexD16.err_lincallback(LinflexD16.device);

  IRQ_EPILOGUE();
}
#endif

#if (SPC5_LINFLEX16_SETTING != SPC5_LINFLEX_MODE_NONE) || defined(__DOXYGEN__)
#if !defined(SPC5_LINFLEX16_RXI_HANDLER)
#error "SPC5_LINFLEX16_RXI_HANDLER not defined"
#endif
/**
 * @brief   LINFlex-16 RXI interrupt handler.
 *
 * @isr
 */
IRQ_HANDLER(SPC5_LINFLEX16_RXI_HANDLER) {

  IRQ_PROLOGUE();

  LinflexD17.rxi_lincallback(LinflexD17.device);

  IRQ_EPILOGUE();
}

#if !defined(SPC5_LINFLEX16_TXI_HANDLER)
#error "SPC5_LINFLEX16_TXI_HANDLER not defined"
#endif
/**
 * @brief   LINFlex-16 TXI interrupt handler.
 *
 * @isr
 */
IRQ_HANDLER(SPC5_LINFLEX16_TXI_HANDLER) {

  IRQ_PROLOGUE();

  LinflexD17.txi_lincallback(LinflexD17.device);

  IRQ_EPILOGUE();
}

#if !defined(SPC5_LINFLEX16_ERR_HANDLER)
#error "SPC5_LINFLEX16_ERR_HANDLER not defined"
#endif
/**
 * @brief   LINFlex-16 ERR interrupt handler.
 *
 * @isr
 */
IRQ_HANDLER(SPC5_LINFLEX16_ERR_HANDLER) {

  IRQ_PROLOGUE();

  LinflexD17.err_lincallback(LinflexD17.device);

  IRQ_EPILOGUE();
}
#endif

#if (SPC5_LINFLEX17_SETTING != SPC5_LINFLEX_MODE_NONE) || defined(__DOXYGEN__)
#if !defined(SPC5_LINFLEX17_RXI_HANDLER)
#error "SPC5_LINFLEX17_RXI_HANDLER not defined"
#endif
/**
 * @brief   LINFlex-17 RXI interrupt handler.
 *
 * @isr
 */
IRQ_HANDLER(SPC5_LINFLEX17_RXI_HANDLER) {

  IRQ_PROLOGUE();

  LinflexD18.rxi_lincallback(LinflexD18.device);

  IRQ_EPILOGUE();
}

#if !defined(SPC5_LINFLEX17_TXI_HANDLER)
#error "SPC5_LINFLEX17_TXI_HANDLER not defined"
#endif
/**
 * @brief   LINFlex-17 TXI interrupt handler.
 *
 * @isr
 */
IRQ_HANDLER(SPC5_LINFLEX17_TXI_HANDLER) {

  IRQ_PROLOGUE();

  LinflexD18.txi_lincallback(LinflexD18.device);

  IRQ_EPILOGUE();
}

#if !defined(SPC5_LINFLEX17_ERR_HANDLER)
#error "SPC5_LINFLEX17_ERR_HANDLER not defined"
#endif
/**
 * @brief   LINFlex-17 ERR interrupt handler.
 *
 * @isr
 */
IRQ_HANDLER(SPC5_LINFLEX17_ERR_HANDLER) {

  IRQ_PROLOGUE();

  LinflexD18.err_lincallback(LinflexD18.device);

  IRQ_EPILOGUE();
}
#endif

#if (SPC5_LINFLEX18_SETTING != SPC5_LINFLEX_MODE_NONE) || defined(__DOXYGEN__)
#if !defined(SPC5_LINFLEX18_RXI_HANDLER)
#error "SPC5_LINFLEX18_RXI_HANDLER not defined"
#endif
/**
 * @brief   LINFlex-18 RXI interrupt handler.
 *
 * @isr
 */
IRQ_HANDLER(SPC5_LINFLEX18_RXI_HANDLER) {

  IRQ_PROLOGUE();

  LinflexD19.rxi_lincallback(LinflexD19.device);

  IRQ_EPILOGUE();
}

#if !defined(SPC5_LINFLEX18_TXI_HANDLER)
#error "SPC5_LINFLEX18_TXI_HANDLER not defined"
#endif
/**
 * @brief   LINFlex-18 TXI interrupt handler.
 *
 * @isr
 */
IRQ_HANDLER(SPC5_LINFLEX18_TXI_HANDLER) {

  IRQ_PROLOGUE();

  LinflexD19.txi_lincallback(LinflexD19.device);

  IRQ_EPILOGUE();
}

#if !defined(SPC5_LINFLEX18_ERR_HANDLER)
#error "SPC5_LINFLEX18_ERR_HANDLER not defined"
#endif
/**
 * @brief   LINFlex-18 ERR interrupt handler.
 *
 * @isr
 */
IRQ_HANDLER(SPC5_LINFLEX18_ERR_HANDLER) {

  IRQ_PROLOGUE();

  LinflexD19.err_lincallback(LinflexD19.device);

  IRQ_EPILOGUE();
}
#endif

#if (SPC5_LINFLEX19_SETTING != SPC5_LINFLEX_MODE_NONE) || defined(__DOXYGEN__)
#if !defined(SPC5_LINFLEX19_RXI_HANDLER)
#error "SPC5_LINFLEX19_RXI_HANDLER not defined"
#endif
/**
 * @brief   LINFlex-19 RXI interrupt handler.
 *
 * @isr
 */
IRQ_HANDLER(SPC5_LINFLEX19_RXI_HANDLER) {

  IRQ_PROLOGUE();

