hungtho/LDC_7kW/KSC_LDC/components/spc570sxx_low_level_drivers_component_rla/lib/src/spc5_linflex.c
  LinflexD20.rxi_lincallback(LinflexD20.device);

  IRQ_EPILOGUE();
}

#if !defined(SPC5_LINFLEX19_TXI_HANDLER)
#error "SPC5_LINFLEX19_TXI_HANDLER not defined"
#endif
/**
 * @brief   LINFlex-19 TXI interrupt handler.
 *
 * @isr
 */
IRQ_HANDLER(SPC5_LINFLEX19_TXI_HANDLER) {

  IRQ_PROLOGUE();

  LinflexD20.txi_lincallback(LinflexD20.device);

  IRQ_EPILOGUE();
}

#if !defined(SPC5_LINFLEX19_ERR_HANDLER)
#error "SPC5_LINFLEX19_ERR_HANDLER not defined"
#endif
/**
 * @brief   LINFlex-19 ERR interrupt handler.
 *
 * @isr
 */
IRQ_HANDLER(SPC5_LINFLEX19_ERR_HANDLER) {

  IRQ_PROLOGUE();

  LinflexD20.err_lincallback(LinflexD20.device);

  IRQ_EPILOGUE();
}
#endif

#if (SPC5_LINFLEX20_SETTING != SPC5_LINFLEX_MODE_NONE) || defined(__DOXYGEN__)
#if !defined(SPC5_LINFLEX20_RXI_HANDLER)
#error "SPC5_LINFLEX20_RXI_HANDLER not defined"
#endif
/**
 * @brief   LINFlex-20 RXI interrupt handler.
 *
 * @isr
 */
IRQ_HANDLER(SPC5_LINFLEX20_RXI_HANDLER) {

  IRQ_PROLOGUE();

  LinflexD21.rxi_lincallback(LinflexD21.device);

  IRQ_EPILOGUE();
}

#if !defined(SPC5_LINFLEX20_TXI_HANDLER)
#error "SPC5_LINFLEX20_TXI_HANDLER not defined"
#endif
/**
 * @brief   LINFlex-20 TXI interrupt handler.
 *
 * @isr
 */
IRQ_HANDLER(SPC5_LINFLEX20_TXI_HANDLER) {

  IRQ_PROLOGUE();

  LinflexD21.txi_lincallback(LinflexD21.device);

  IRQ_EPILOGUE();
}

#if !defined(SPC5_LINFLEX20_ERR_HANDLER)
#error "SPC5_LINFLEX20_ERR_HANDLER not defined"
#endif
/**
 * @brief   LINFlex-20 ERR interrupt handler.
 *
 * @isr
 */
IRQ_HANDLER(SPC5_LINFLEX20_ERR_HANDLER) {

  IRQ_PROLOGUE();

  LinflexD21.err_lincallback(LinflexD21.device);

  IRQ_EPILOGUE();
}
#endif

#if (SPC5_LINFLEX21_SETTING != SPC5_LINFLEX_MODE_NONE) || defined(__DOXYGEN__)
#if !defined(SPC5_LINFLEX21_RXI_HANDLER)
#error "SPC5_LINFLEX21_RXI_HANDLER not defined"
#endif
/**
 * @brief   LINFlex-21 RXI interrupt handler.
 *
 * @isr
 */
IRQ_HANDLER(SPC5_LINFLEX21_RXI_HANDLER) {

  IRQ_PROLOGUE();

  LinflexD22.rxi_lincallback(LinflexD22.device);

  IRQ_EPILOGUE();
}

#if !defined(SPC5_LINFLEX21_TXI_HANDLER)
#error "SPC5_LINFLEX21_TXI_HANDLER not defined"
#endif
/**
 * @brief   LINFlex-21 TXI interrupt handler.
 *
 * @isr
 */
IRQ_HANDLER(SPC5_LINFLEX21_TXI_HANDLER) {

  IRQ_PROLOGUE();

  LinflexD22.txi_lincallback(LinflexD22.device);

  IRQ_EPILOGUE();
}

#if !defined(SPC5_LINFLEX21_ERR_HANDLER)
#error "SPC5_LINFLEX21_ERR_HANDLER not defined"
#endif
/**
 * @brief   LINFlex-21 ERR interrupt handler.
 *
 * @isr
 */
IRQ_HANDLER(SPC5_LINFLEX21_ERR_HANDLER) {

  IRQ_PROLOGUE();

  LinflexD22.err_lincallback(LinflexD22.device);

  IRQ_EPILOGUE();
}
#endif

#if (SPC5_LINFLEX22_SETTING != SPC5_LINFLEX_MODE_NONE) || defined(__DOXYGEN__)
#if !defined(SPC5_LINFLEX22_RXI_HANDLER)
#error "SPC5_LINFLEX22_RXI_HANDLER not defined"
#endif
/**
 * @brief   LINFlex-22 RXI interrupt handler.
 *
 * @isr
 */
IRQ_HANDLER(SPC5_LINFLEX22_RXI_HANDLER) {

  IRQ_PROLOGUE();

  LinflexD23.rxi_lincallback(LinflexD23.device);

  IRQ_EPILOGUE();
}

#if !defined(SPC5_LINFLEX22_TXI_HANDLER)
#error "SPC5_LINFLEX22_TXI_HANDLER not defined"
#endif
/**
 * @brief   LINFlex-22 TXI interrupt handler.
 *
 * @isr
 */
IRQ_HANDLER(SPC5_LINFLEX22_TXI_HANDLER) {

  IRQ_PROLOGUE();

  LinflexD23.txi_lincallback(LinflexD23.device);

  IRQ_EPILOGUE();
}

#if !defined(SPC5_LINFLEX22_ERR_HANDLER)
#error "SPC5_LINFLEX22_ERR_HANDLER not defined"
#endif
/**
 * @brief   LINFlex-22 ERR interrupt handler.
 *
 * @isr
 */
IRQ_HANDLER(SPC5_LINFLEX22_ERR_HANDLER) {

  IRQ_PROLOGUE();

  LinflexD23.err_lincallback(LinflexD23.device);

  IRQ_EPILOGUE();
}
#endif

#if (SPC5_LINFLEX23_SETTING != SPC5_LINFLEX_MODE_NONE) || defined(__DOXYGEN__)
#if !defined(SPC5_LINFLEX23_RXI_HANDLER)
#error "SPC5_LINFLEX23_RXI_HANDLER not defined"
#endif
/**
 * @brief   LINFlex-23 RXI interrupt handler.
 *
 * @isr
 */
IRQ_HANDLER(SPC5_LINFLEX23_RXI_HANDLER) {

  IRQ_PROLOGUE();

  LinflexD24.rxi_lincallback(LinflexD24.device);

  IRQ_EPILOGUE();
}

#if !defined(SPC5_LINFLEX23_TXI_HANDLER)
#error "SPC5_LINFLEX23_TXI_HANDLER not defined"
#endif
/**
 * @brief   LINFlex-23 TXI interrupt handler.
 *
 * @isr
 */
IRQ_HANDLER(SPC5_LINFLEX23_TXI_HANDLER) {

  IRQ_PROLOGUE();

  LinflexD24.txi_lincallback(LinflexD24.device);

  IRQ_EPILOGUE();
}

#if !defined(SPC5_LINFLEX23_ERR_HANDLER)
#error "SPC5_LINFLEX23_ERR_HANDLER not defined"
#endif
/**
 * @brief   LINFlex-23 ERR interrupt handler.
 *
 * @isr
 */
IRQ_HANDLER(SPC5_LINFLEX23_ERR_HANDLER) {

  IRQ_PROLOGUE();

  LinflexD24.err_lincallback(LinflexD24.device);

  IRQ_EPILOGUE();
}
#endif

/*===========================================================================*/
/* Driver exported functions.                                                */
/*===========================================================================*/

/**
 * @brief   Low level linflex driver initialization.
 *
 * @init
 */
void linflex_lld_init(void) {

  /* Check the LinFlex initialization flag in
     order to run the initialization once.*/
  if (linflex_initialization == 0U) {
    linflex_initialization++;

#if (SPC5_LINFLEX0_SETTING != SPC5_LINFLEX_MODE_NONE)
    INTC_PSR (SPC5_LINFLEX0_RXI_NUMBER) = SPC5_LINFLEX0_PRIORITY;
    INTC_PSR (SPC5_LINFLEX0_TXI_NUMBER) = SPC5_LINFLEX0_PRIORITY;
    INTC_PSR (SPC5_LINFLEX0_ERR_NUMBER) = SPC5_LINFLEX0_PRIORITY;
#endif /* SPC5_LINFLEX0_SETTING */

#if (SPC5_LINFLEX1_SETTING != SPC5_LINFLEX_MODE_NONE)
    INTC_PSR (SPC5_LINFLEX1_RXI_NUMBER) = SPC5_LINFLEX1_PRIORITY;
    INTC_PSR (SPC5_LINFLEX1_TXI_NUMBER) = SPC5_LINFLEX1_PRIORITY;
    INTC_PSR (SPC5_LINFLEX1_ERR_NUMBER) = SPC5_LINFLEX1_PRIORITY;
#endif /* SPC5_LINFLEX1_SETTING*/

#if (SPC5_LINFLEX2_SETTING != SPC5_LINFLEX_MODE_NONE)
    INTC_PSR (SPC5_LINFLEX2_RXI_NUMBER) = SPC5_LINFLEX2_PRIORITY;
    INTC_PSR (SPC5_LINFLEX2_TXI_NUMBER) = SPC5_LINFLEX2_PRIORITY;
    INTC_PSR (SPC5_LINFLEX2_ERR_NUMBER) = SPC5_LINFLEX2_PRIORITY;
#endif /* SPC5_LINFLEX2_SETTING */

#if (SPC5_LINFLEX3_SETTING != SPC5_LINFLEX_MODE_NONE)
    INTC_PSR (SPC5_LINFLEX3_RXI_NUMBER) = SPC5_LINFLEX3_PRIORITY;
    INTC_PSR (SPC5_LINFLEX3_TXI_NUMBER) = SPC5_LINFLEX3_PRIORITY;
    INTC_PSR (SPC5_LINFLEX3_ERR_NUMBER) = SPC5_LINFLEX3_PRIORITY;
#endif /* SPC5_LINFLEX3_SETTING */

#if (SPC5_LINFLEX4_SETTING != SPC5_LINFLEX_MODE_NONE)
    INTC_PSR (SPC5_LINFLEX4_RXI_NUMBER) = SPC5_LINFLEX4_PRIORITY;
    INTC_PSR (SPC5_LINFLEX4_TXI_NUMBER) = SPC5_LINFLEX4_PRIORITY;
    INTC_PSR (SPC5_LINFLEX4_ERR_NUMBER) = SPC5_LINFLEX4_PRIORITY;
#endif /* SPC5_LINFLEX4_SETTING*/

