hungtho/LDC_7kW/KSC_LDC/components/spc570sxx_low_level_drivers_component_rla/lib/src/spc5_linflex.c
#if (SPC5_LINFLEX5_SETTING != SPC5_LINFLEX_MODE_NONE)
    INTC_PSR (SPC5_LINFLEX5_RXI_NUMBER) = SPC5_LINFLEX5_PRIORITY;
    INTC_PSR (SPC5_LINFLEX5_TXI_NUMBER) = SPC5_LINFLEX5_PRIORITY;
    INTC_PSR (SPC5_LINFLEX5_ERR_NUMBER) = SPC5_LINFLEX5_PRIORITY;
#endif /* SPC5_LINFLEX5_SETTING */

#if (SPC5_LINFLEX6_SETTING != SPC5_LINFLEX_MODE_NONE)
    INTC_PSR (SPC5_LINFLEX6_RXI_NUMBER) = SPC5_LINFLEX6_PRIORITY;
    INTC_PSR (SPC5_LINFLEX6_TXI_NUMBER) = SPC5_LINFLEX6_PRIORITY;
    INTC_PSR (SPC5_LINFLEX6_ERR_NUMBER) = SPC5_LINFLEX6_PRIORITY;
#endif /* SPC5_LINFLEX6_SETTING */

#if (SPC5_LINFLEX7_SETTING != SPC5_LINFLEX_MODE_NONE)
    INTC_PSR (SPC5_LINFLEX7_RXI_NUMBER) = SPC5_LINFLEX7_PRIORITY;
    INTC_PSR (SPC5_LINFLEX7_TXI_NUMBER) = SPC5_LINFLEX7_PRIORITY;
    INTC_PSR (SPC5_LINFLEX7_ERR_NUMBER) = SPC5_LINFLEX7_PRIORITY;
#endif /* SPC5_LINFLEX7_SETTING */

#if (SPC5_LINFLEX8_SETTING != SPC5_LINFLEX_MODE_NONE)
    INTC_PSR (SPC5_LINFLEX8_RXI_NUMBER) = SPC5_LINFLEX8_PRIORITY;
    INTC_PSR (SPC5_LINFLEX8_TXI_NUMBER) = SPC5_LINFLEX8_PRIORITY;
    INTC_PSR (SPC5_LINFLEX8_ERR_NUMBER) = SPC5_LINFLEX8_PRIORITY;
#endif /* SPC5_LINFLEX8_SETTING */

#if (SPC5_LINFLEX9_SETTING != SPC5_LINFLEX_MODE_NONE)
    INTC_PSR (SPC5_LINFLEX9_RXI_NUMBER) = SPC5_LINFLEX9_PRIORITY;
    INTC_PSR (SPC5_LINFLEX9_TXI_NUMBER) = SPC5_LINFLEX9_PRIORITY;
    INTC_PSR (SPC5_LINFLEX9_ERR_NUMBER) = SPC5_LINFLEX9_PRIORITY;
#endif /* SPC5_LINFLEX9_SETTING */

#if (SPC5_LINFLEX10_SETTING != SPC5_LINFLEX_MODE_NONE)
    INTC_PSR (SPC5_LINFLEX10_RXI_NUMBER) = SPC5_LINFLEX10_PRIORITY;
    INTC_PSR (SPC5_LINFLEX10_TXI_NUMBER) = SPC5_LINFLEX10_PRIORITY;
    INTC_PSR (SPC5_LINFLEX10_ERR_NUMBER) = SPC5_LINFLEX10_PRIORITY;
#endif /* SPC5_LINFLEX10_SETTING */

#if (SPC5_LINFLEX11_SETTING != SPC5_LINFLEX_MODE_NONE)
    INTC_PSR (SPC5_LINFLEX11_RXI_NUMBER) = SPC5_LINFLEX11_PRIORITY;
    INTC_PSR (SPC5_LINFLEX11_TXI_NUMBER) = SPC5_LINFLEX11_PRIORITY;
    INTC_PSR (SPC5_LINFLEX11_ERR_NUMBER) = SPC5_LINFLEX11_PRIORITY;
#endif /* SPC5_LINFLEX11_SETTING */

#if (SPC5_LINFLEX12_SETTING != SPC5_LINFLEX_MODE_NONE)
    INTC_PSR (SPC5_LINFLEX12_RXI_NUMBER) = SPC5_LINFLEX12_PRIORITY;
    INTC_PSR (SPC5_LINFLEX12_TXI_NUMBER) = SPC5_LINFLEX12_PRIORITY;
    INTC_PSR (SPC5_LINFLEX12_ERR_NUMBER) = SPC5_LINFLEX12_PRIORITY;
#endif /* SPC5_LINFLEX12_SETTING */

#if (SPC5_LINFLEX13_SETTING != SPC5_LINFLEX_MODE_NONE)
    INTC_PSR (SPC5_LINFLEX13_RXI_NUMBER) = SPC5_LINFLEX13_PRIORITY;
    INTC_PSR (SPC5_LINFLEX13_TXI_NUMBER) = SPC5_LINFLEX13_PRIORITY;
    INTC_PSR (SPC5_LINFLEX13_ERR_NUMBER) = SPC5_LINFLEX13_PRIORITY;
#endif /* SPC5_LINFLEX13_SETTING */

#if (SPC5_LINFLEX14_SETTING != SPC5_LINFLEX_MODE_NONE)
    INTC_PSR (SPC5_LINFLEX14_RXI_NUMBER) = SPC5_LINFLEX14_PRIORITY;
    INTC_PSR (SPC5_LINFLEX14_TXI_NUMBER) = SPC5_LINFLEX14_PRIORITY;
    INTC_PSR (SPC5_LINFLEX14_ERR_NUMBER) = SPC5_LINFLEX14_PRIORITY;
#endif /* SPC5_LINFLEX14_SETTING */

#if (SPC5_LINFLEX15_SETTING != SPC5_LINFLEX_MODE_NONE)
    INTC_PSR (SPC5_LINFLEX15_RXI_NUMBER) = SPC5_LINFLEX15_PRIORITY;
    INTC_PSR (SPC5_LINFLEX15_TXI_NUMBER) = SPC5_LINFLEX15_PRIORITY;
    INTC_PSR (SPC5_LINFLEX15_ERR_NUMBER) = SPC5_LINFLEX15_PRIORITY;
#endif /* SPC5_LINFLEX15_SETTING */

#if (SPC5_LINFLEX16_SETTING != SPC5_LINFLEX_MODE_NONE)
    INTC_PSR (SPC5_LINFLEX16_RXI_NUMBER) = SPC5_LINFLEX16_PRIORITY;
    INTC_PSR (SPC5_LINFLEX16_TXI_NUMBER) = SPC5_LINFLEX16_PRIORITY;
    INTC_PSR (SPC5_LINFLEX16_ERR_NUMBER) = SPC5_LINFLEX16_PRIORITY;
#endif /* SPC5_LINFLEX16_SETTING */

#if (SPC5_LINFLEX17_SETTING != SPC5_LINFLEX_MODE_NONE)
    INTC_PSR (SPC5_LINFLEX17_RXI_NUMBER) = SPC5_LINFLEX17_PRIORITY;
    INTC_PSR (SPC5_LINFLEX17_TXI_NUMBER) = SPC5_LINFLEX17_PRIORITY;
    INTC_PSR (SPC5_LINFLEX17_ERR_NUMBER) = SPC5_LINFLEX17_PRIORITY;
#endif /* SPC5_LINFLEX17_SETTING */

#if (SPC5_LINFLEX18_SETTING != SPC5_LINFLEX_MODE_NONE)
    INTC_PSR (SPC5_LINFLEX18_RXI_NUMBER) = SPC5_LINFLEX18_PRIORITY;
    INTC_PSR (SPC5_LINFLEX18_TXI_NUMBER) = SPC5_LINFLEX18_PRIORITY;
    INTC_PSR (SPC5_LINFLEX18_ERR_NUMBER) = SPC5_LINFLEX18_PRIORITY;
#endif /* SPC5_LINFLEX18_SETTING */

#if (SPC5_LINFLEX19_SETTING != SPC5_LINFLEX_MODE_NONE)
    INTC_PSR (SPC5_LINFLEX19_RXI_NUMBER) = SPC5_LINFLEX19_PRIORITY;
    INTC_PSR (SPC5_LINFLEX19_TXI_NUMBER) = SPC5_LINFLEX19_PRIORITY;
    INTC_PSR (SPC5_LINFLEX19_ERR_NUMBER) = SPC5_LINFLEX19_PRIORITY;
#endif /* SPC5_LINFLEX19_SETTING */

#if (SPC5_LINFLEX20_SETTING != SPC5_LINFLEX_MODE_NONE)
    INTC_PSR (SPC5_LINFLEX20_RXI_NUMBER) = SPC5_LINFLEX20_PRIORITY;
    INTC_PSR (SPC5_LINFLEX20_TXI_NUMBER) = SPC5_LINFLEX20_PRIORITY;
    INTC_PSR (SPC5_LINFLEX20_ERR_NUMBER) = SPC5_LINFLEX20_PRIORITY;
#endif /* SPC5_LINFLEX20_SETTING */

#if (SPC5_LINFLEX21_SETTING != SPC5_LINFLEX_MODE_NONE)
    INTC_PSR (SPC5_LINFLEX21_RXI_NUMBER) = SPC5_LINFLEX21_PRIORITY;
    INTC_PSR (SPC5_LINFLEX21_TXI_NUMBER) = SPC5_LINFLEX21_PRIORITY;
    INTC_PSR (SPC5_LINFLEX21_ERR_NUMBER) = SPC5_LINFLEX21_PRIORITY;
#endif /* SPC5_LINFLEX21_SETTING */

#if (SPC5_LINFLEX22_SETTING != SPC5_LINFLEX_MODE_NONE)
    INTC_PSR (SPC5_LINFLEX22_RXI_NUMBER) = SPC5_LINFLEX22_PRIORITY;
    INTC_PSR (SPC5_LINFLEX22_TXI_NUMBER) = SPC5_LINFLEX22_PRIORITY;
    INTC_PSR (SPC5_LINFLEX22_ERR_NUMBER) = SPC5_LINFLEX22_PRIORITY;
#endif /* SPC5_LINFLEX22_SETTING */

#if (SPC5_LINFLEX23_SETTING != SPC5_LINFLEX_MODE_NONE)
    INTC_PSR (SPC5_LINFLEX23_RXI_NUMBER) = SPC5_LINFLEX23_PRIORITY;
    INTC_PSR (SPC5_LINFLEX23_TXI_NUMBER) = SPC5_LINFLEX23_PRIORITY;
    INTC_PSR (SPC5_LINFLEX23_ERR_NUMBER) = SPC5_LINFLEX23_PRIORITY;
#endif /* SPC5_LINFLEX23_SETTING */

  }
}

#endif /* LLD_USE_SERIAL */

/** @} */
